# Exercises

In [1]:
import pandas as pd

__ex 1:__ Convert the following 2 lists into a pandas dataframe with two columns: "id" and "value"

In [2]:
x = [1, 2, 3, 4, 5]
y = ["A", "B", "C", "D", "E"]

In [3]:
df = pd.DataFrame({"id": x, "value": y})
df

   id value
0   1     A
1   2     B
2   3     C
3   4     D
4   5     E

__ex 2:__ Read the file `customer.csv` into a pandas dataframe.

In [4]:
df = pd.read_csv("customer.csv")

__ex 2.1:__ Assign the number of rows to variable `nrows` and number of features to `ncols`. Use the assert cell block to evaluate your answer.

In [5]:
nrows, ncols = df.shape

In [6]:
assert nrows == 10
assert ncols == 3

__ex 2.2:__ Display the first 3 rows of the dataframe

In [7]:
df.head(3)

  cid  age  income
0  c1   20  1200.0
1  c2   25  1400.0
2  c3   23  1400.0

__ex 2.3:__ Print the name of the dataframe columns

In [8]:
df.columns

Index(['cid', 'age', 'income'], dtype='object')

__ex 2.5:__ What are the types of each feature?

In [9]:
df.dtypes

cid        object
age         int64
income    float64
dtype: object

__ex 2.6:__ What is the maximum and minimum income?

In [10]:
_min = df["income"].min()
_max = df["income"].max()

print(f"Min income: {_min}")
print(f"Max income: {_max}")

Min income: 1200.0
Max income: 4000.0

__ex 3:__ Import the dataset `customer.csv` into a pandas DataFrame

In [11]:
df = pd.read_csv("banks.csv")

__ex 3.1:__ Show the first 5 records of this dataframe

In [12]:
df.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
0,Fayette County Bank,Saint Elmo,IL,1802,"United Fidelity Bank, fsb",26-May-17,1-Jun-17
1,"Guaranty Bank, (d/b/a BestBank in Georgia & Mi...",Milwaukee,WI,30003,First-Citizens Bank & Trust Company,5-May-17,1-Jun-17
2,First NBC Bank,New Orleans,LA,58302,Whitney Bank,28-Apr-17,23-May-17
3,Proficio Bank,Cottonwood Heights,UT,35495,Cache Valley Bank,3-Mar-17,18-May-17
4,Seaway Bank and Trust Company,Chicago,IL,19328,State Bank of Texas,27-Jan-17,18-May-17

__ex 3.2:__ How many states (ST) are represented in this dataset? What are they?

In [13]:
print(df["ST"].unique())
print(f"""Nr. of unique states: {df["ST"].nunique()}""")

['IL' 'WI' 'LA' 'UT' 'NJ' 'AR' 'GA' 'PA' 'TN' 'WA' 'CO' 'PR' 'FL' 'MN'
 'CA' 'MD' 'OK' 'OH' 'SC' 'VA' 'ID' 'TX' 'CT' 'AZ' 'NV' 'NC' 'KY' 'MO'
 'KS' 'AL' 'MI' 'IN' 'IA' 'NE' 'MS' 'NM' 'OR' 'NY' 'MA' 'SD' 'WY' 'WV'
 'NH' 'HI']
Nr. of unique states: 44

__ex 3.3:__ How many "CERT" values are above 20000?

In [14]:
df[df["CERT"] > 20000].shape[0]

417

__ex 3.4:__ Sort the bank names alphabetically

In [15]:
df = df.sort_values(by="Bank Name")
df.head()

,Bank Name,City,ST,CERT,Acquiring Institution,Closing Date,Updated Date
345,1st American State Bank of Minnesota,Hancock,MN,15448,"Community Development Bank, FSB",5-Feb-10,1-Nov-13
498,1st Centennial Bank,Redlands,CA,33025,First California Bank,23-Jan-09,13-Apr-16
46,1st Commerce Bank,North Las Vegas,NV,58358,Plaza Bank,6-Jun-13,12-Jul-13
293,1st Pacific Bank of California,San Diego,CA,35517,City National Bank,7-May-10,13-Dec-12
59,1st Regents Bank,Andover,MN,57157,First Minnesota Bank,18-Jan-13,12-Jul-16

__ex 3.5:__ Create a subset dataframe with the following conditions:
- From state "CA"
- With a "CERT" higher than 30 000
- Contains only variables `Bank Name`, `ST`, `CERT`

How many records are there?

In [16]:
subset = df[(df["ST"] == "CA") & (df["CERT"] > 30000)]
subset = subset[["Bank Name", "ST", "CERT"]]
print(len(subset))

24

In [17]:
subset.head()

                          Bank Name  ST   CERT
498             1st Centennial Bank  CA  33025
293  1st Pacific Bank of California  CA  35517
245            Butte Community Bank  CA  33219
391        California National Bank  CA  34659
186            Canyon National Bank  CA  34692

__ex 3.6:__ Using the subset from `ex: 3.5`, create a new variable called `flag` with value "below" if the `CERT` value is below 40 000, otherwise, set it to "above"

In [18]:
subset["flag"] = "below"
subset.loc[subset["CERT"] >= 40000, "flag"] = "above"

__ex 3.7:__ Drop the variable "CERT" and "ST"

In [19]:
subset.drop(columns=["ST", "CERT"], inplace=True)

__ex 3.8:__ How many "above" and "below" banks do you have?

In [20]:
subset["flag"].value_counts()

below    16
above     8
Name: flag, dtype: int64